{
  "menu.home": "Home",
  "menu.portfolio": "Portfolio",
  "menu.resume": "Resume",
  "menu.contact": "Contact",
  "home.title": "Hi, I am ",
  "home.subtitle": "I'm a Web developer and tester.",
  "home.button":"WORK WITH ME!",
  "portfolio.button":"VISIT",
  "portfolio.button1":"DOCUMENTATION",
  "resume.txt":" Specialist in ",
  "resume.y":"and",
  "resume.txt1":" with experience in diagnosing and repairing of ",
  "resume.text2":" in computer systems and networks. Additionally, I have strong skills as ",
  "resume.text3":" My focus is on ensuring the security and efficiency of systems while creating functional and optimized websites. ",
  "resume.button":" View CV ",
  "resume.button1":" View Roadmap ",
  "contact.title":" Julian's phone ",
  "contact.element.tel":" Telephone ",
  "contact.element.email":" Email ",
  "contact.modal.label": " Call ",
  "contact.modal.label1": " Message ",
  "contact.modal.label2": " Your Email: ",
  "contact.modal.label3": " Your message: ",
  "contact.modal.button": " Accept ",
  "contact.modal.button1": " Send ",
  "cv.title":" Developer | QA ",
  "cv.subtitle":" Hi, I am Julian Molineris ",
  "cv.contact":" Contact ",
  "cv.habilities":"Habilities",
  "cv.habilities.item":"Project management",
  "cv.habilities.item1":"Databases",
  "cv.abilities.item2": "Manual and automation testing",
  "cv.habilities.itemgraphic":" Creativity ",
  "cv.habilities.itemgraphic1":" Objetivity ",
  "cv.habilities.itemgraphic2":" Effectiveness ",
  "cv.habilities.itemgraphic3":" Organization ",
  "cv.habilities.itemgraphic4":"Leadership",
  "cv.habilities.itemgrapich5":"Autonomy",
  "cv.language":" Languages ",
  "cv.language.eng":" Intermediate ",
  "cv.language.eng1":" English ",
  "cv.language.esp":" Native ",
  "cv.language.esp1":" Spanish ",
  "cv.tools":"Tools",
  "cv.frameworks":"Languages and frameworks",
  "cv.experience":"Experience",
  "cv.experience.title":"uTest - Test Cycles",
  "cv.experience.subtitle":"Performing different test cycles for various e-commerce stores by designing and executing test cases and creating bug reports.",
  "cv.experience.title1":"BrandMonkey - Web Development",
  "cv.experience.subtitle1":"Development of various custom-made websites tailored to meet clients' specific needs.",
  "cv.experience.subtitle2":"PORTFOLIO: julianmolineris.com",
  "cv.profile":" Profile ",
  "cv.profile.txt":"I am a young professional with a strong background in both soft and technical skills. My goal is to work in a company that provides me with the opportunity to share my knowledge while receiving training to enhance and optimize my abilities.",
  "cv.button1":"See more",
  "cv.education": "Education",
  "cv.education.item.title": " EDUCACIÓN IT ",
  "cv.education.item.subtitle": " QA testing manual/automation. ",
  "cv.education.item1.title": " COURSERA ",
  "cv.education.item1.subtitle": "Functional software testing.",
  "cv.education.item2.title": " GOOGLE ",
  "cv.education.item2.subtitle": " Information Technology Support. ",
  "cv.education.item3.title": " UDEMY ",
  "cv.education.item3.subtitle": " Relational Databases MYSQL. ",
  "cv.education.item4.title": " PLATZI ",
  "cv.education.item4.subtitle": " MERN Application Development.",
  "cv.education.item5.title": " EGG COOP. ",
  "cv.education.item5.subtitle": "QA Testing, Manual and Automation.",
  "cv.education.item6.title": "ONE - ORACLE",
  "cv.education.item6.subtitle": "Web Development (HTML, CSS, and JS).",
  "cv.education.item7.title": "CISCO",
  "cv.education.item7.subtitle": " Cybersecurity Certification. ",
  "cv.education.item8.title": " MINDHUB ",
  "cv.education.item8.subtitle": "Web Development Bootcamp.",
  "cv.education.item9.title": " ARG. PROGRAMA ",
  "cv.education.item9.subtitle": " Full Stack Developer. ",
  "cv.right":"2023 Julian Molineris - All Rights Reserved",
"roadmap.title": "IMAGINE MEETING SOMEONE WITH A 5-MINUTE TRAILER.",
"roadmap.subtitle": "This is my trailer: 'I am Julián'.",
"roadmap.fecha1": "September 12, 2000, 5:00 PM.",
"roadmap.item1.title": "The Beginning",
"roadmap.item1.content": "I was born in the city of Rosario, Argentina. I was the first child in my family.",
"roadmap.item1.contentmodal": "On February 27, 1812, General Manuel Belgrano hoisted the newly created Argentine flag for the first time on the banks of the 'Paraná' River. Due to this, Rosario is known as the 'Birthplace of the Argentine Flag'.",
"roadmap.item1.contentmodal1": "commemorates this occasion.",
"roadmap.item1.contentmodal2": "The National Flag Memorial",
"roadmap.item1.item1": "Mom",
"roadmap.item1.item": "Dad",
"roadmap.item1.item2": "Me",
"roadmap.fecha2": "May 10, 2008, 3:00 PM.",
"roadmap.item2.title": "Revealing Discovery",
"roadmap.item2.content": "My childhood curiosity led me to come across a square device filled with cables and circuit boards, stored in an old cabinet.",
"roadmap.item2.contentmodal": "At that moment, I didn't know it, but what I had in front of me was an old computer. That incredible encounter marked the beginning of an exciting journey into the world of technology. A flame ignited within me, driving me to explore and unravel its mysteries.",
"roadmap.fecha3": "June 20, 2011, 5:00 PM.",
"roadmap.item3.title": "Curiosity and Learning",
"roadmap.item3.content": "Driven by overwhelming curiosity, I ventured to disassemble any electronic device that crossed my path, to explore its interior and unravel its mysterious mechanisms.",
"roadmap.item3.contentmodal": "Although my parents often scolded me for breaking things that still worked, this practice allowed me to acquire knowledge about the structure and functioning of devices, giving me the opportunity to learn to repair non-functional objects. These experiences provided me with invaluable learning and strengthened my bond with technology.",
"roadmap.fecha4": "March 1, 2012, 10:00 AM.",
"roadmap.item4.title": "Nurturing the Passion",
"roadmap.item4.content": "Recognizing my fascination with technology, my parents enrolled me in a 2-year robotics course. During this course, I learned the fundamentals of software development using block-based programming tools and practical principles of electronics. It was an enriching experience that allowed me to deepen my knowledge and skills in the field of technology.",
"roadmap.item4.contentmodal": "It was a crucial step in my journey, as this course allowed me to understand fundamental concepts of programming and electronics, develop practical skills, and connect with other technology-enthusiastic children. It opened new frontiers for me, expanding my mind with endless possibilities and pushing me to explore beyond my limits.",
"roadmap.fecha5": "September 12, 2014, 11:00 AM.",
"roadmap.item5.title": "A Gift of Possibilities",
"roadmap.item5.content": "On my 14th birthday, my parents surprised me with a gift that changed my life: a computer. That technological device became my gateway to a virtual universe of information, creativity, and opportunities.",
"roadmap.item5.contentmodal": "This gift became the driving force I needed to immerse myself in the world of software. I delved into the Internet and discovered YouTube, where I learned to create websites, animations, and graphic design.",
"roadmap.fecha6": "July 5, 2015, 9:00 AM.",
"roadmap.item6.title": "Entrepreneurial Spirit",
"roadmap.item6.content": "During my adolescence, I felt a strong attraction towards entrepreneurship and leadership, leading me to participate in various workshops where I had the opportunity to interact with numerous people. At the same time, I continued working on personal projects, building robots, and creating websites.",
"roadmap.item6.contentmodal": "Fostering my entrepreneurial spirit became a significant focus. I participated in workshops and programs that fostered business skills and leadership qualities. During this time, I turned to YouTube as a valuable resource, immersing myself in tutorials and educational content to acquire the knowledge needed to carry out my software projects. This period allowed me to combine my passion for technology with an entrepreneurial mindset, laying the groundwork for future challenges and ventures.",
"roadmap.fecha7": "April 22, 2016, 7:00 AM.",
"roadmap.item7.title": "Innovation and Growth",
"roadmap.item7.content": "In 2016, I had the opportunity to participate in a technological innovation workshop at ",
"roadmap.item7.content1": ", where I gained the tools and knowledge necessary to shape my ideas and improve my communication skills. Additionally, I had the privilege of winning first place for innovation in the inaugural edition of the NASA Space Apps Challenge in my city, which allowed me to meet important political figures and present my projects to them.",
"roadmap.item7.contentmodal": "On this occasion, I was awarded for my innovative proposal. Thanks to these events, I had the opportunity to meet the mayor of my city and the governor, and present them with my project. These images capture the essence of a remarkable year of personal growth and achievements, and you can view them by clicking on the gallery icon.",
"roadmap.fecha8": "November 12, 2017, 8:00 PM.",
"roadmap.item8.title": "Protecting My Information",
"roadmap.item8.content": "This year, I became a victim of a cyberattack that forced me to renew all my accounts and passwords. It was a distressing situation as I lost a significant amount of information and photos, but it taught me a valuable lesson: I needed to better safeguard my online security.",
"roadmap.item8.contentmodal": "In response to this experience, I decided to enroll in cybersecurity courses on Udemy. Through these courses, I learned about methods used by cybercriminals to steal sensitive data and, most importantly, I learned how to protect myself from them. I acquired knowledge about security measures such as using strong passwords, detecting phishing attempts, and safeguarding my network and devices. These courses provided me with the necessary tools to strengthen my online security and prevent future attacks. Now, I am more aware of the risks and take proactive steps to protect my personal information and stay safe in the digital world.",
"roadmap.fecha9": "December 15, 2018, 8:00 AM.",
"roadmap.item9.title": "My First Work Experience",
"roadmap.item9.content": "I completed my high school studies and enrolled in the Systems Engineering program. As I began my studies and learned more about the field, I realized it was not what I was looking for at that moment, so I decided to work in the family business.",
"roadmap.item9.contentmodal": "Using my web development skills, I created a website to sell imported flashlights from China. At the same time, I started studying systems engineering, but as I delved deeper into the field, I realized it was not the right fit for me at that moment, which led me to work in my family's butcher shop. After a few months, the opportunity to rent a butcher shop arose, which gave me the experience of working independently for a year.",
"roadmap.fecha10": "February 2, 2020, 9:00 AM.",
"roadmap.item10.title": "Resilience and Rediscovery",
"roadmap.item10.content": "In February 2020, I felt ready to resume my university career and enrolled in the systems engineering course while continuing to work in the butcher shop. However, the year took an unexpected turn when COVID-19 was declared a pandemic on my first day of classes, leading to the suspension of in-person classes. I decided to continue working and invested all the money I was earning in a 3D printer and electronic supplies to manufacture and sell educational robots online.",
"roadmap.item10.contentmodal": "My educational robot project turned out to be a disaster. I knew nothing about 3D printing and had to learn from scratch how to use modeling programs. Although I made several robots, I decided to keep them because I needed more practice to improve the designs and achieve a perfect product. During my research to improve the robot designs, I came across a project that combined web development with robotics: an internet-controlled car robot. Although the project seemed ambitious and I had limited knowledge in backend development and the required boards and controllers, I felt the need to dive into it. Exploring this project forced me to learn more about web applications and get updated with new tools and frameworks. Initially, I mainly relied on HTML, CSS, and JavaScript, but witnessing the advancements brought by new frameworks and libraries sparked a desire in me to focus more on the possibilities offered by modern software development.",
"roadmap.fecha11": "July 22, 2020, 7:00 AM.",
"roadmap.item11.title": "IT Support",
"roadmap.item11.content": "When the pandemic came to an end, I organized my life and designed a three-year plan to study and work in technology creation. I decided to save enough money to step away from long-term work at the butcher shop and fully dedicate myself to my studies. I started with computer and cellphone repair courses, and months later, a unique opportunity presented itself: I was selected to participate in a Google training program in 'IT Support'.",
"roadmap.item11.contentmodal": "In the computer and cellphone repair courses, I studied each component, gaining a deeper understanding of their functioning. In July, an incredible opportunity presented itself. After a month-long selection process, I was chosen to participate in a Google training program in 'IT Support'. This program was divided into two parts: the technical aspect and an additional block focused on teamwork, soft skills, and collaboration, led by Junior Achievement and Coursera. My mentors provided me with the necessary boost to feel confident and confirm that I was on the right path, strengthening my desire to join the IT field and work in technology creation.",
"roadmap.fecha12": "February 22, 2021, 3:00 PM.",
"roadmap.item12.title": "The World of Software Testing",
"roadmap.item12.content": "I obtained the IT Support certification from Google and became an advanced user of operating systems. I already understood how computers worked, both in terms of hardware and software, and their configurations. I knew how to properly repair and maintain my working tool. After that, I still needed to learn how software is created and its processes. I started on YouTube, my old learning platform, until the end of February, when I was invited by an organization where I had taken previous courses, to participate in a training offered by 'The Coca-Cola Company' and the 'Nahual Foundation' on something called 'manual software testing'.",
"roadmap.item12.contentmodal": "I got to work and researched everything I could about manual software testing. I found that it fit perfectly with what I was learning about software production. So, I decided to take the admission exam and wait. At the same time, I found complete YouTube channels on software testing that I still follow to this day. March came, and I finally received the long-awaited email: 'You have been selected.' It was an incredible experience; I gained in-depth knowledge of all aspects related to manual testing and its application in work environments, as well as frameworks, especially Scrum and Kanban approaches. My mentors guided me through the process, and I knew I had to continue with quality assurance testing and learn how to manage databases.",
"roadmap.fecha13": "August 10, 2021, 8:00 AM.",
"roadmap.item13.title": "QA Testing",
"roadmap.item13.content": "After completing the training in manual testing, I decided to explore quality assurance (QA) testing, a more comprehensive and complementary version of manual testing. I found a 6-month training program offered by 'Educación IT' and the 'Telefónica Foundation'. The selection process was similar to that of IT Support and, although it was a bit lengthy, I was finally selected. During this training, I acquired many technical skills about testing and had my first introduction to the quintessential testing programming language: Java.",
"roadmap.item13.contentmodal": "This training was undoubtedly the most complex and demanding. It required many hours of study and practice to fully grasp all the elements that make up a QA tester and pass multiple exams and tasks. I learned to handle the basics of Java and complementary testing tools like Selenium, JUnit, JIRA, and Azure. It was a challenging but highly rewarding process that allowed me to develop fundamental skills and knowledge in the field of quality assurance (QA) testing.",
"roadmap.fecha14": "September 1, 2022, 7:00 AM",
"roadmap.item14.title": "Expanding My Skills",
"roadmap.item14.content": "After gaining knowledge about software testing, it was time to professionalize my focus on how software is created. Throughout this year, I seized every opportunity that arose in terms of web development courses.",
"roadmap.item14.contentmodal": "I started with the 'Argentina Programa' training, which provided an overview of programming logic. In the first part, we solved simple exercises using a pseudocode language called 'Gobstones', and then moved on to working with JavaScript, Java, and Ruby. In the second part, we focused more on theoretical aspects, addressing the software development cycle and delving into HTML, CSS, and JavaScript. Later on, frameworks like React and Angular were introduced, along with SQL databases. Finally, we concluded with a project that integrated everything we had learned. In my case, I decided to focus on React and Node while deepening my understanding of both relational (SQL) and non-relational (MongoDB) databases.",
"roadmap.fecha15": "January 5, 2023, 10:00 AM",
"roadmap.item15.title": "Hello World!",
"roadmap.item15.content": "This year, I joined Platzi to continue my education in web development and improve my English skills. At the same time, I received an invitation from 'Argentina Programa' to participate in a web development bootcamp offered by 'MindHub' until mid-year. During this bootcamp, I became more familiar with agile approaches applied to programming, especially with the use of Scrum. Every day, we had planning meetings at the beginning of the day, worked as a team throughout the day, and ended with a closing meeting.",
"roadmap.item15.contentmodal": "It was a very interesting experience due to the teamwork and collaboration that replicated a real work environment. We were assigned projects and completed them within the Scrum framework, guided by our mentors. After finishing this training with Argentina Programa, I received an invitation to participate in a selection process and pursue a career as a 'Tester' at the 'Egg Corporation' incubator. The selection process lasted a month and a half and included basic concepts and multiple exams. After successfully completing this stage, the first module was a general introduction to all aspects of testing. The next stage focused on manual testing, and then we moved on to the final stage, which covered quality assurance (QA) testing, providing us with a solid foundation in all aspects of testing and its tools.",
"roadmap.fecha16": "August 10, 2023, 8:00 AM",
"roadmap.item16.title": "Putting Into Practice",
"roadmap.item16.content": "I joined UTest, completed their academy training, and then worked on third-party platform testing projects to practice my testing skills. Additionally, I dedicated myself to deepening my knowledge of React and Node, as well as databases, by developing applications using both SQL and MongoDB. I also complemented my skills with a full-stack development Oracle and Alura training that I am currently undertaking. In another matter, I was invited to participate in a contest organized by The Coca-Cola Company Foundation, where I presented a business idea that I had developed during my entrepreneurship workshops some years ago. I was selected among the top 10 ideas in the country and started the project on my own.",
"roadmap.item16.contentmodal": "Podes agregar mas contenido",
"roadmap.item17":"Loading...Click here to see what's next.",
"roadmap.start":"Start",
"roadmap.end":"End of the roadmap.",
"roadmap.button":"Read more..."
}                 