{
  "menu.home": "Inicio",
  "menu.portfolio": "Portafolio",
  "menu.resume": "Resumen",
  "menu.contact": "Contacto",
  "home.title": "Hola, soy ",
  "home.subtitle": "Soy un desarrollador Web y tester.",
  "home.button":"¡TRABAJA CONMIGO!",
  "portfolio.button":"VISITAR",
  "portfolio.button1":"DOCUMENTACIÓN",
  "resume.txt":" Soy un especialista en",
  "resume.y":"y",
  "resume.txt1":" con experiencia en el diagnóstico y reparación de ",
  "resume.txt2":" en sistemas informáticos y redes. Además, poseo sólidas habilidades como ",
  "resume.txt3":"  Mi enfoque se centra en garantizar la seguridad y eficiencia de los sistemas mientras creo sitios web funcionales y optimizados. ",
  "resume.button":"VER CV",
  "resume.button1":"VER DOCUMENTACIÓN",
  "contact.title":"Teléfono de Julian",
  "contact.element.tel":"Teléfono",
  "contact.element.mail":"Correo Electronico",
  "contact.modal.label":"Llamar",
  "contact.modal.label1":"Mensaje",
  "contact.modal.label2":"Tu Correo Electrónico:",
  "contact.modal.label3":"Tu mensaje:",
  "contact.modal.button":"Aceptar",
  "cv.title": "Desarrollador | QA",
"cv.subtitle": "¡Hola, soy Julian Molineris!",
"cv.contact": "Contacto",
"cv.abilities": "Habilidades",
"cv.abilities.item": "Gestión de proyectos",
"cv.abilities.item1": "Bases de datos",
"cv.abilities.item2": "Testing manual y automatizado",
"cv.abilities.itemgraphic": "Creatividad",
"cv.abilities.itemgraphic1": "Objetividad",
"cv.abilities.itemgraphic2": "Efectividad",
"cv.abilities.itemgraphic3": "Organización",
"cv.abilities.itemgraphic4": "Liderazgo",
"cv.abilities.itemgraphic5": "Autonomía",
"cv.languages": "Idiomas",
"cv.languages.eng": "Inglés intermedio",
"cv.languages.eng1": " intermedio",
"cv.languages.esp": "Español nativo",
"cv.languages.esp1": " nativo",
"cv.tools": "Herramientas",
"cv.frameworks": "Frameworks de lenguaje",
"cv.experience": "Experiencia",
"cv.experience.title": "uTest - Ciclos de Pruebas",
"cv.experience.subtitle": "Realizando diferentes ciclos de pruebas para varias tiendas de comercio electrónico mediante el diseño y ejecución de casos de prueba y la creación de informes de errores.",
"cv.experience.title1": "BrandMonkey (Emprendimiento) - Desarrollo Web",
"cv.experience.subtitle1": "Desarrollo de varios sitios web personalizados adaptados a las necesidades específicas de los clientes.",
"cv.experience.subtitle2": "PORTFOLIO: julianmolineris.com",
"cv.profile": "Perfil",
"cv.profile.txt": "Soy un profesional joven con una sólida formación en habilidades técnicas y blandas. Mi objetivo es trabajar en una empresa que me brinde la oportunidad de compartir mis conocimientos mientras recibo capacitación para mejorar y optimizar mis habilidades.",
"cv.button1": "Ver más",
"cv.education": "Educación",
"cv.education.item": "EDUCACIÓN IT",
"cv.education.item.subtitle": "Pruebas QA manuales/automatizadas.",
"cv.education.item1.title": "COURSERA",
"cv.education.item1.subtitle": "Pruebas funcionales de software.",
"cv.education.item2.title": "GOOGLE",
"cv.education.item2.subtitle": "Soporte en Tecnologías de la Información.",
"cv.education.item3.title": "UDEMY",
"cv.education.item3.subtitle": "Bases de Datos Relacionales MYSQL.",
"cv.education.item4.title": "PLATZI",
"cv.education.item4.subtitle": "Desarrollo de Aplicaciones MERN.",
"cv.education.item5.title": "EGG COOP.",
"cv.education.item5.subtitle": "Pruebas QA, Manuales y Automatizadas.",
"cv.education.item6.title": "ONE - ORACLE",
"cv.education.item6.subtitle": "Desarrollo Web (HTML, CSS y JS).",
"cv.education.item7.title": "CISCO",
"cv.education.item7.subtitle": "Certificación en Ciberseguridad.",
"cv.education.item8.title": "MINDHUB",
"cv.education.item8.subtitle": "Bootcamp de Desarrollo Web.",
"cv.education.item9.title": "ARG. PROGRAMA",
"cv.education.item9.subtitle": "Desarrollador Full Stack.",
"cv.right":"2023 Julian Molineris - Todos los Derechos Reservados",
"roadmap.title":"IMAGINA CONOCER A ALGUIEN CON UN TRÁILER DE 5 MINUTOS.",
"roadmap.subtitle":"Este es mi tráiler: 'Yo soy Julián'.",
"roadmap.fecha1": "12 de september del 2000, 5:00 PM.",
"roadmap.item1.title":"El inicio",
"roadmap.item1.content":"Nací en la ciudad de Rosario, Argentina. Fui el primer hijo en mi familia.",
"roadmap.item1.contentmodal":"El 27 de febrero de 1812, el General Manuel Belgrano izó por primera vez la recién creada bandera argentina en las orillas del río 'Paraná'. Debido a esto, Rosario es conocida como la 'Cuna de la Bandera Argentina'. El" ,
"roadmap.item1.contentmodal1": "conmemora esta ocasión.",
"roadmap.item1.contentmodal2": " Monumento Nacional A La Bandera",
"roadmap.item1.item1":"Mama",
"roadmap.item1.item":"Papa",
"roadmap.item1.item2":"Yo",
"roadmap.fecha2": "10 de mayo del 2008, 3:00 PM.",
"roadmap.item2.title":"Descubrimiento revelador",
"roadmap.item2.content":"Mi curiosidad de niño me llevó a encontrarme con un dispositivo cuadrado lleno de cables y placas de circuito, guardado en un viejo armario.",
"roadmap.item2.contentmodal":"En ese momento, yo no lo sabía, pero lo que tenía frente a mí era una antigua computadora.  Ese increíble encuentro marcó el comienzo de un emocionante viaje hacia el mundo de la tecnología. Una llama se encendió dentro de mí, impulsándome a explorar y desentrañar sus misterios.",
"roadmap.fecha3": "20 de Junio, del 2011, 5:00 PM.",
"roadmap.item3.title":"Curiosidad y Aprendizaje",
"roadmap.item3.content":" Impulsado por una curiosidad abrumadora, me aventuraba a desarmar cualquier dispositivo electrónico que se cruzara en mi camino, para explorar su interior y desentrañar sus misteriosos mecanismos. ",
"roadmap.item3.contentmodal":"Aunque mis padres a menudo me regañaban por romper cosas que aún funcionaban, esta práctica me permitió adquirir conocimientos sobre la estructura y el funcionamiento de los dispositivos, dándome la oportunidad de aprender a reparar objetos que no estaban funcionando. Estas experiencias me brindaron un aprendizaje invaluable y fortalecieron mi vínculo con la tecnología.",
"roadmap.fecha4": "01 de marzo del 2012, 10:00 AM.",
"roadmap.item4.title":"Alimentando la Pasión",
"roadmap.item4.content":" Reconociendo mi fascinación por la tecnología, mis padres me inscribieron en un curso de robótica de 2 años. Durante este curso, aprendí los fundamentos del desarrollo de software utilizando herramientas de programación basadas en bloques y principios prácticos de electrónica. Fue una experiencia enriquecedora que me permitió profundizar mis conocimientos y habilidades en el campo de la tecnología. ",
"roadmap.item4.contentmodal":" Fue un paso crucial en mi camino, ya que este curso me permitió comprender conceptos fundamentales de programación y electrónica, desarrollar habilidades prácticas y relacionarme con otros niños entusiastas de la tecnología. Abrió nuevas fronteras para mí, expandiendo mi mente con posibilidades infinitas y empujándome a explorar más allá de mis límites. ",
"roadmap.fecha5": "12 de septiembre del 2014, 11:00 AM.",
"roadmap.item5.title":"Un regalo de posibilidades",
"roadmap.item5.content":" Al cumplir 14 años, mis padres me sorprendieron con un regalo que cambió mi vida: una computadora. Ese dispositivo tecnológico se convirtió en mi puerta de entrada a un universo virtual de información, creatividad y oportunidades. ",
"roadmap.item5.contentmodal":" Este regalo se convirtió en la fuerza impulsora que necesitaba para sumergirme en el mundo del software. Me adentré en Internet y descubrí YouTube, donde aprendí a crear sitios web, animaciones y diseño gráfico. ",
"roadmap.fecha6": "05 de julio del 2015, 9:00 AM.",
"roadmap.item6.title":"Espiritu emprendedor",
"roadmap.item6.content":" Durante mi adolescencia, sentí una fuerte atracción hacia el emprendimiento y el liderazgo, lo que me llevó a participar en diversos talleres donde tuve la oportunidad de interactuar con numerosas personas. Al mismo tiempo, continué trabajando en proyectos personales, construyendo robots y creando sitios web. ",
"roadmap.item6.contentmodal":" Fomentar mi espíritu emprendedor se convirtió en un enfoque significativo. Participé en talleres y programas que fomentaban habilidades empresariales y cualidades de liderazgo. Durante este tiempo, recurrí a YouTube como un recurso valioso, sumergiéndome en tutoriales y contenido educativo para adquirir el conocimiento necesario para llevar a cabo mis proyectos de software. Este período me permitió combinar mi pasión por la tecnología con una mentalidad emprendedora, sentando las bases para futuros desafíos y emprendimientos. ",
"roadmap.fecha7": "22 de abril del 2016, 7:00 AM.",
"roadmap.item7.title":" Innovación y Crecimiento ",
"roadmap.item7.content":" En 2016, tuve la oportunidad de participar en un taller de innovación tecnológica en  ",
"roadmap.item7.content1":", donde obtuve las herramientas y el conocimiento necesarios para dar forma a mis ideas y mejorar mis habilidades de comunicación. Adicionalmente, tuve el privilegio de ganar el primer lugar en innovación en la edición inaugural del NASA Space Apps Challenge en mi ciudad, lo que me permitió conocer a importantes figuras políticas y presentarles mis proyectos.",
"roadmap.item7.contentmodal":" En ese año fui premiado por mi propuesta innovadora. Gracias a estos eventos, tuve la oportunidad de conocer al intendente de mi ciudad y al gobernador, y presentarles mi proyecto. Estas imágenes capturan la esencia de un año notable de crecimiento personal y logros, y puedes verlas haciendo clic en el ícono de la galería. ",
"roadmap.fecha8": "12 de noviembre del 2017, 8:00 PM." ,
"roadmap.item8.title": "Protegiendo mí información",
"roadmap.item8.content":" Este año, fui víctima de un ciberataque que me obligó a renovar todas mis cuentas y contraseñas. Fue una situación angustiante, ya que perdí una cantidad significativa de información y fotos, pero me enseñó una lección valiosa: necesitaba cuidar mejor mi seguridad en línea. ",
"roadmap.item8.contentmodal":" En respuesta a esta experiencia, decidí inscribirme en cursos de ciberseguridad en Udemy. A través de estos cursos, aprendí sobre los métodos utilizados por los ciberdelincuentes para robar datos sensibles y, lo más importante, aprendí cómo protegerme de ellos. Adquirí conocimientos sobre medidas de seguridad como el uso de contraseñas fuertes, la detección de intentos de phishing y la protección de mi red y dispositivos. Estos cursos me proporcionaron las herramientas necesarias para fortalecer mi seguridad en línea y prevenir futuros ataques. Ahora estoy más consciente de los riesgos y tomo medidas proactivas para proteger mi información personal y mantenerme seguro en el mundo digital. ",
"roadmap.fecha9": "15 de diciembre del 2018, 8:00 AM.",
"roadmap.item9.title":" My primer experiencia laboral",
"roadmap.item9.content":" Completé mis estudios secundarios y me inscribí en la carrera de Ingeniería en Sistemas. A medida que aprendía más sobre el campo, me di cuenta de que no era lo que estaba buscando en ese momento. Así que decidí dejar de estudiar en la universidad y empezar a trabajar en el negocio familiar. ",
"roadmap.item9.contentmodal":" Utilizando mis habilidades de desarrollo web, creé un sitio web para vender linternas importadas de China. Después de unos meses de trabajar en la carnicería de mi familia, surgió la oportunidad de alquilar una carnicería, lo que me brindó la experiencia de trabajar de manera independiente durante un año. ",
"roadmap.fecha10": "02 de febrero del 2020, 9:00 AM.",
"roadmap.item10.title":" Resiliencia y redescubrimiento ",
"roadmap.item10.content":" En febrero de 2020, me sentí listo para retomar mi carrera universitaria y me inscribí en el curso de ingeniería de sistemas mientras seguía trabajando en la carnicería. Sin embargo, el año tomó un giro inesperado cuando el COVID-19 fue declarado como una pandemia en mi primer día de clases, lo que llevó a la suspensión de las clases presenciales. Decidí continuar trabajando y invertí todo el dinero que estaba ganando en una impresora 3D y suministros electrónicos para fabricar y vender robots educativos en línea. ",
"roadmap.item10.contentmodal":" Mi proyecto de robots educativos resultó ser un desastre. No sabía nada sobre impresión 3D y tuve que aprender desde cero cómo usar programas de modelado. Aunque hice varios robots, decidí quedármelos porque necesitaba más práctica para mejorar los diseños y lograr un producto perfecto. Durante mi investigación para mejorar los diseños de los robots, me encontré con un proyecto que combinaba desarrollo web con robótica: un robot de coche controlado por Internet. A pesar de que el proyecto parecía ambicioso y tenía conocimientos limitados en desarrollo backend y en las placas y controladores requeridos, sentí la necesidad de sumergirme en él. Explorar este proyecto me obligó a aprender más sobre aplicaciones web y actualizarme con nuevas herramientas y frameworks. Al principio, todo era pueo HTML, CSS y JavaScript, pero al presenciar los avances traídos por nuevos frameworks y bibliotecas, surgió en mí un deseo de enfocarme más en las posibilidades que ofrece el desarrollo de software moderno.",
"roadmap.fecha11": "22 de julio del 2020, 7:00 AM.",
"roadmap.item11.title":" Soporte IT ",
"roadmap.item11.content":" Cuando la pandemia llegó a su fin, organicé mi vida y diseñé un plan de tres años para estudiar y trabajar en la creación de tecnología. Decidí ahorrar suficiente dinero para alejarme del trabajo a largo plazo en la carnicería y dedicarme por completo a mis estudios. Comencé con cursos de reparación de computadoras y teléfonos celulares, y meses después, se presentó una oportunidad única: fui seleccionado para participar en un programa de capacitación de Google en 'Soporte de TI'.",
"roadmap.item11.contentmodal":"En los cursos de reparación de computadoras, estudié cada componente, adquiriendo un conocimiento más profundo de su funcionamiento. En julio, se presentó una increíble oportunidad. Después de un proceso de selección de un mes, fui elegido para participar en un programa de capacitación de Google en 'Soporte de TI'. Este programa se dividió en dos partes: el aspecto técnico y un bloque adicional enfocado en el trabajo en equipo, habilidades blandas y colaboración, liderado por Junior Achievement y Coursera. Mis mentores me brindaron el impulso necesario para sentirme seguro y confirmar que estaba en el camino correcto, fortaleciendo mi deseo de unirme al campo de TI y trabajar en la creación de tecnología.",
"roadmap.fecha12": "22 de febrero del 2021, 15 :00 AM.",
"roadmap.item12.title":" El mundo del testing de software ",
"roadmap.item12.content":" Obtuve la certificación en Soporte de TI por Google y me convertí en un usuario avanzado de sistemas operativos. Ya comprendía cómo funcionaban las computadoras, tanto en términos de hardware como de software, y sus configuraciones. Sabía cómo reparar y mantener adecuadamente mi herramienta de trabajo. Después de eso, aún necesitaba aprender cómo se crea el software y sus procesos. Comencé en YouTube, mi antigua plataforma de aprendizaje, hasta finales de febrero, cuando fui invitado por una organización donde había tomado cursos anteriormente, a participar en una capacitación ofrecida por 'The Coca-Cola Company' y la Fundación 'Nahual', en algo llamado 'pruebas manuales de software'.",
"roadmap.item12.contentmodal":"Me puse manos a la obra e investigué todo lo que pude sobre pruebas manuales de software. Descubrí que encajaba perfectamente con lo que estaba aprendiendo sobre producción de software. Por lo tanto, decidí tomar el examen de admisión y esperar. Al mismo tiempo, encontré canales de YouTube completos sobre pruebas de software que todavía sigo hasta el día de hoy. Llegó marzo y finalmente llegó el tan esperado correo electrónico: 'Has sido seleccionado'. Fue una experiencia increíble; adquirí un conocimiento profundo de todos los aspectos relacionados con las pruebas manuales y su aplicación en entornos laborales, así como de marcos de trabajo, especialmente los enfoques Scrum y Kanban. Mis mentores me guiaron en el proceso y supe que debía seguir con las pruebas de aseguramiento de calidad y aprender a gestionar bases de datos.",
"roadmap.fecha13": "10 de agosto del 2021, 8:00 AM.",
"roadmap.item13.title":"Testing QA ",
"roadmap.item13.content":" Después de completar el entrenamiento en pruebas manuales, decidí explorar las pruebas de aseguramiento de calidad (QA), una versión más completa y complementaria de las pruebas manuales. Encontré un programa de formación de 6 meses ofrecido por 'Educación IT' y la Fundación 'Telefónica'. El proceso de selección fue similar al de IT Support y, aunque fue un poco largo, finalmente fui seleccionado. Durante este entrenamiento, adquirí muchos conocimientos técnicos sobre pruebas y tuve mi primera introducción al lenguaje de programación de pruebas por excelencia: Java.",
"roadmap.item13.contentmodal":" Este entrenamiento fue sin duda el más complejo y exigente. Requirió muchas horas de estudio y práctica para comprender completamente todos los elementos que conforman un tester de QA y aprobar varios exámenes y tareas. Aprendí a manejar los conceptos básicos de Java y herramientas complementarias de pruebas como Selenium, JUnit, JIRA y Azure. Fue un proceso desafiante pero altamente gratificante que me permitió desarrollar habilidades y conocimientos fundamentales en el campo de las pruebas de aseguramiento de calidad (QA).",   
"roadmap.fecha14": " 01 septiembre del 2022, 7:00 AM ",
"roadmap.item14.title":" Expandiendo mis habilidades ",
"roadmap.item14.content":" Después de adquirir conocimientos sobre las pruebas de software, llegó el momento de profesionalizar mi enfoque en cómo se crea el software. A lo largo de este año, aproveché cada oportunidad que surgió en términos de cursos de desarrollo web.",
"roadmap.item14.contentmodal":"Comencé con el entrenamiento 'Argentina programa', que me proporcionó una visión general de la lógica de programación. En la primera parte, resolvimos ejercicios simples utilizando un lenguaje de pseudocódigo llamado 'Gobstones', y luego pasamos a trabajar con JavaScript, Java y Ruby. En la segunda parte, nos enfocamos más en aspectos teóricos, abordando el ciclo de desarrollo de software y profundizando en HTML, CSS y JavaScript. Posteriormente, se introdujeron frameworks como React y Angular, junto con bases de datos SQL. Finalmente, concluimos con un proyecto que integró todo lo que habíamos aprendido. En mi caso, decidí enfocarme en React y Node, mientras profundizaba mi comprensión tanto de las bases de datos relacionales (SQL) como de las bases de datos no relacionales (MongoDB).",
"roadmap.fecha15": " 05 enero del 2023, 10:00 AM ",
"roadmap.item15.title": " ¡Hola mundo! ",
"roadmap.item15.content": " Este año, me uní a Platzi para continuar mi educación en desarrollo web y mejorar mis habilidades en inglés. Al mismo tiempo, recibí una invitación de 'Argentina Programa' para participar en un bootcamp de desarrollo web ofrecido por 'MindHub' hasta mediados de año. Durante este bootcamp, me familiaricé más con enfoques ágiles aplicados a la programación, especialmente con el uso de Scrum. Todos los días, teníamos reuniones de planificación al inicio del día, trabajábamos como equipo durante todo el día y terminábamos con una reunión de cierre.",
"roadmap.item15.contentmodal": " Fue una experiencia muy interesante debido al trabajo en equipo y la colaboración que replicaba un entorno de trabajo real. Se nos asignaron proyectos y los completamos dentro del marco de Scrum, guiados por nuestros mentores. Después de terminar esta formación con Argentina Programa, recibí una invitación para participar en un proceso de selección y seguir una carrera como 'Tester' en la incubadora 'Egg Corporation'. El proceso de selección duró un mes y medio e incluyó conceptos básicos y múltiples exámenes. Después de completar con éxito esta etapa, el primer módulo fue una introducción general a todos los aspectos del testing. La siguiente etapa se centró en el testing manual y luego pasamos a la etapa final, que abarcaba el testing de aseguramiento de calidad (QA), proporcionándonos una base sólida en todos los aspectos del testing y sus herramientas.",
"roadmap.fecha16": " 10 de agosto del 2023, 8:00 AM ",
"roadmap.item16.title": " Llevar a la practica ",
"roadmap.item16.content": " Después de unos meses, organicé un equipo reclutando a personas interesadas en unirse, y actualmente somos un equipo de 6 personas, cada una responsable de un área diferente. Trabajamos en el proyecto 'BrandMonkey' como pasatiempo, junto con nuestras tareas diarias. Seguimos un marco de trabajo similar a Scrum, donde asumo los roles de Scrum Master y Product Owner. Tenemos reuniones a menudo con todos los miembros para discutir preguntas y decidir las tareas para la próxima semana. También realizamos sprints cada 15 días. Gracias a este proyecto, he aprendido mucho más sobre negocios, procesos de desarrollo, gestión de datos y, sobre todo, liderazgo de equipo. Además, me he involucrado más en proyectos de Node, trabajando con React e incorporando inteligencia artificial en algunas producciones.",
"roadmap.item16.contentmodal": "Podes agregar mas contenido",
"roadmap.item17":"Cargando... Haz clic aquí para ver qué sigue.",
"roadmap.start":"Inicio",
"roadmap.end":"Fin del roadmap.",
"roadmap.button":"Leer más..."
}  

